# Buổi 9: Nhóm và sắp xếp dữ liệu
- Biến đổi dữ liệu
- Nhóm và sắp xếp dữ liệu
- Xử lý các vấn đề với dữ liệu: thiếu dữ liệu, sai kiểu dữ liệu, trùng lặp dữ liệu, ...
- Thực hành

In [20]:
import pandas as pd

def clean_networth(networth): # loại bỏ phần tử đầu - cuối: $ B
    return networth[1:-1]
    

df = pd.read_csv('./Billionaires.csv', index_col=[0])
df.info() # lấy thông tin dữ liệu

df['Net Worth'] = df['Net Worth'].apply(clean_networth)
df['Net Worth'] = pd.to_numeric(df['Net Worth']) # chuyển từ string => Float

## Biến đổi dữ liệu cho cột age
df['Age'] = df['Age'].astype('Int64')
df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 2640 entries, 1 to 2540
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 2640 non-null   object
 1   Net Worth            2640 non-null   object
 2   Age                  2576 non-null   float64
 3   Country | Territory  2640 non-null   object
 4   Source               2640 non-null   object
 5   Industry             2640 non-null   object
dtypes: float64(1), object(5)
memory usage: 144.4+ KB

,Name,Net Worth,Age,Country | Territory,Source,Industry
Rank,,,,,,
1,Bernard Arnault & family,211.0,74,France,LVMH,Fashion & Retail
2,Elon Musk,180.0,51,United States,"Tesla, SpaceX",Automotive
3,Jeff Bezos,114.0,59,United States,Amazon,Technology
4,Larry Ellison,107.0,78,United States,Oracle,Technology
5,Warren Buffett,106.0,92,United States,Berkshire Hathaway,Finance & Investments

Biến đổi dữ liệu cột 'Net Worth' từ string => float

Tổng tài sản lớn nhất của các tỉ phú nằm ở những lĩnh vực nào?

In [ ]:
df_industry = df[['Industry', 'Net Worth']].groupby('Industry').sum() # trả về đối tượng DF Groupby
# Sx theo thứ tự 
df_industry = df_industry.sort_values(by='Net Worth', ascending=False) # từ lớn => nhỏ (ngược lại là true)
df_industry

                            Net Worth
Industry
Technology                     1871.0
Fashion & Retail               1698.8
Finance & Investments          1605.1
Manufacturing                  1025.9
Food & Beverage                 957.2
Diversified                     905.2
Real Estate                     657.4
Healthcare                      643.2
Automotive                      525.3
Energy                          453.5
Metals & Mining                 446.8
Media & Entertainment           427.5
Logistics                       239.5
Telecom                         203.5
Service                         173.4
Sports                          134.5
Gambling & Casinos              120.5
Construction & Engineering      118.5

Thực hành: Tính trung bình tài sản các tỷ phú theo châu lục
- Chưa có cột châu lục?
- Cần biến đổi từ cột: Country | Territory
- Sử dụng thư viện và hàm hỗ trợ để tạo cột "Continent"

In [34]:
import pycountry_convert as pc

def get_continent(country_name):
    try: 
        country_code = pc.country_name_to_country_alpha2(country_name)
        continent_code = pc.country_alpha2_to_continent_code(country_code)
        continent_name = pc.convert_continent_code_to_continent_name(continent_code)
        return continent_name
    except:
        print(country_name)
        return 'unknown'
    

df['Continent'] = df['Country | Territory'].apply(get_continent)

## Chỉ show 2 cột cần thôi
df[['Net Worth', 'Continent']].groupby("Continent").mean()

## Nếu muốn tìm ra cái không xác định
# df[df['Continent'] == 'unknown']

Eswatini (Swaziland)

               Net Worth
Continent
Africa          4.421053
Asia            3.547064
Europe          4.853279
North America   6.025276
Oceania         3.924000
South America   3.375000
unknown         6.500000